# 2.1 - Pandas Deepdive

![pandas_deep](images/pandas_deep.jpg)

In [1]:
import pandas as pd
import numpy as np

### Importar un archivo

In [2]:
# desde un zip

import zipfile

zf=zipfile.ZipFile('../data/mahindra.zip')

ctr=pd.read_csv(zf.open('test.csv'), nrows=1e4)

ctr.head()

,reservation_id,booking_date,checkin_date,checkout_date,channel_code,main_product_code,numberofadults,numberofchildren,persontravellingid,resort_region_code,...,season_holidayed_code,state_code_residence,state_code_resort,total_pax,member_age_buckets,booking_type_code,memberid,cluster_code,reservationstatusid_code,resort_id
0,7dae1ce6bc8f69481328f2be5c4943077dad5598b5f66d...,05/04/18,05/04/18,06/04/18,3,2,2,0,45,3,...,2.0,2.0,3,3,H,1,2114944930dcc42ce5b9b50ae965cf8a9c04e46be63d84...,A,C,9f14025af0065b30e47e23ebb3b491d39ae8ed17d33739...
1,fe0d4e444e1818436c88f72f1cf800536c2f785e59baeb...,24/05/15,23/06/15,27/06/15,1,2,4,0,45,1,...,2.0,2.0,4,2,H,1,2114944930dcc42ce5b9b50ae965cf8a9c04e46be63d84...,F,A,e7f6c011776e8db7cd330b54174fd76f7d0216b612387a...
2,540bd4285ad8168e8388f84ee74a82cd4f97dc0a404d3e...,21/07/15,07/08/15,10/08/15,3,2,3,0,45,2,...,4.0,2.0,2,3,H,1,2114944930dcc42ce5b9b50ae965cf8a9c04e46be63d84...,D,A,d4735e3a265e16eee03f59718b9b5d03019c07d8b6c51f...
3,09593c907ae262e46f655b4db9e14f54a19eadcfdd2679...,31/07/15,22/10/15,25/10/15,1,2,3,0,45,1,...,2.0,2.0,6,3,H,1,2114944930dcc42ce5b9b50ae965cf8a9c04e46be63d84...,F,A,49d180ecf56132819571bf39d9b7b342522a2ac6d23c14...
4,f4c50caac68051faf37551d70bb17eebef2a20e2244cb1...,01/07/16,01/10/16,05/10/16,1,2,4,0,45,1,...,2.0,2.0,11,2,H,1,2114944930dcc42ce5b9b50ae965cf8a9c04e46be63d84...,F,A,e29c9c180c6279b0b02abd6a1801c7c04082cf486ec027...

In [4]:
ctr.to_csv('../data/prueba.csv', index=False)

In [6]:
ctr.to_excel('../data/prueba.xlsx', index=False)

In [24]:
df=pd.read_excel('../data/Online Retail.xlsx')

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [9]:
df.shape

(396034, 10)

In [11]:
len(df)  # numero de filas

396034

In [12]:
lst=[]

for i in range(len(df)):
    
    if i%2:  # si es impar, el numero
        lst.append(i)
    else:  # si no None
        lst.append(None)
        
lst[:10]

[None, 1, None, 3, None, 5, None, 7, None, 9]

In [25]:
# crear una columna con nulos

df['Null ID']=[i if i%2 else None for i in range(len(df))]

df.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country,Null ID
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [19]:
# renombrar columnas

df.columns

Index(['InvoiceNo', 'InvoiceDate', 'StockCode', 'Description', 'Quantity',
       'UnitPrice', 'Revenue', 'CustomerID', 'Country', 'Null ID'],
      dtype='object')

In [20]:
# asi tienen que ser todas

df.columns=[c.lower().replace(' ', '') for c in df.columns]

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [21]:
n_cols=[c.lower().replace(' ', '') for c in df.columns]

In [26]:
{k:v for k,v in zip(df.columns, n_cols)}

{'InvoiceNo': 'invoiceno',
 'InvoiceDate': 'invoicedate',
 'StockCode': 'stockcode',
 'Description': 'description',
 'Quantity': 'quantity',
 'UnitPrice': 'unitprice',
 'Revenue': 'revenue',
 'CustomerID': 'customerid',
 'Country': 'country',
 'Null ID': 'nullid'}

In [27]:
# k=vieja columna, v=nueva columna, todas o algunas

df=df.rename(columns={k:v for k,v in zip(df.columns, n_cols)})  # todas

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [23]:
df=df.rename(columns={'nullid': 'null'})  # solo una

df.head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,null
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

### Descripción de los datos

In [28]:
df.shape

(396034, 10)

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 30.2+ MB

In [30]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 93.7 MB

In [31]:
df2=df.copy()

In [32]:
df.count() # valores NO nulos

invoiceno      396034
invoicedate    396034
stockcode      396034
description    396034
quantity       396034
unitprice      396034
revenue        396034
customerid     396034
country        396034
nullid         198017
dtype: int64

In [34]:
df.country.unique()   # valores unicos

array(['United Kingdom', 'Spain', 'Cyprus', 'EIRE', 'Portugal',
       'Netherlands', 'Australia', 'Singapore', 'Switzerland', 'Finland',
       'Channel Islands', 'France', 'Malta', 'Italy', 'Israel', 'Germany',
       'Austria', 'Norway', 'Denmark', 'Sweden', 'Belgium', 'Canada',
       'Poland', 'Japan', 'Iceland', 'Greece', 'Lebanon', 'South Africa',
       'Czech Republic', 'USA', 'Brazil', 'United Arab Emirates',
       'Lithuania', 'Saudi Arabia', 'Bahrain'], dtype=object)

In [35]:
len(df.country.unique())

35

In [36]:
df.country.value_counts()  # contar los valores unicos

United Kingdom          353983
Germany                   8658
France                    8034
EIRE                      7136
Spain                     2422
Netherlands               2322
Belgium                   1935
Switzerland               1810
Portugal                  1425
Australia                 1181
Norway                    1048
Channel Islands            744
Italy                      741
Finland                    647
Cyprus                     612
Sweden                     428
Austria                    384
Denmark                    367
Poland                     325
Japan                      321
Israel                     248
Singapore                  215
Iceland                    182
USA                        179
Canada                     150
Greece                     142
Malta                      109
United Arab Emirates        67
South Africa                57
Lebanon                     45
Lithuania                   35
Brazil                      32
Czech Republic              24
Bahrain                     17
Saudi Arabia                 9
Name: country, dtype: int64

In [37]:
# descripcion estadistica

df.describe()

,invoiceno,quantity,unitprice,revenue,customerid,nullid
count,396034.000000,396034.000000,396034.000000,396034.000000,396034.000000,198017.000000
mean,560620.294401,12.624838,2.867826,21.492062,15302.695435,198017.000000
std,13110.655964,42.816911,4.265226,93.863439,1709.744925,114325.456929
min,536365.000000,1.000000,0.040000,0.060000,12347.000000,1.000000
25%,549198.500000,2.000000,1.250000,4.680000,13975.000000,99009.000000
50%,561894.000000,6.000000,1.950000,11.800000,15160.000000,198017.000000
75%,572095.000000,12.000000,3.750000,19.800000,16805.000000,297025.000000
max,581587.000000,4800.000000,649.500000,38970.000000,18287.000000,396033.000000

In [38]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
invoiceno,396034.0,560620.294401,13110.655964,536365.00,549198.50,561894.00,572095.00,581587.0
quantity,396034.0,12.624838,42.816911,1.00,2.00,6.00,12.00,4800.0
unitprice,396034.0,2.867826,4.265226,0.04,1.25,1.95,3.75,649.5
revenue,396034.0,21.492062,93.863439,0.06,4.68,11.80,19.80,38970.0
customerid,396034.0,15302.695435,1709.744925,12347.00,13975.00,15160.00,16805.00,18287.0
nullid,198017.0,198017.000000,114325.456929,1.00,99009.00,198017.00,297025.00,396033.0

In [41]:
df.describe(include='all').T

/var/folders/fv/zc4lh9sn7bnf55fy6jhl0k900000gn/T/ipykernel_5512/377021028.py:1: FutureWarning: Treating datetime data as categorical rather than numeric in `.describe` is deprecated and will be removed in a future version of pandas. Specify `datetime_is_numeric=True` to silence this warning and adopt the future behavior now.
  df.describe(include='all').T

,count,unique,top,freq,first,last,mean,std,min,25%,50%,75%,max
invoiceno,396034.0,NaN,NaN,NaN,NaT,NaT,560620.294401,13110.655964,536365.0,549198.5,561894.0,572095.0,581587.0
invoicedate,396034,17155,2011-11-14 15:27:00,541,2010-12-01 08:26:00,2011-12-09 12:50:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN
stockcode,396034,3658,85123A,2035,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
description,396034,3640,CREAM HANGING HEART T-LIGHT HOLDER,2035,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
quantity,396034.0,NaN,NaN,NaN,NaT,NaT,12.624838,42.816911,1.0,2.0,6.0,12.0,4800.0
unitprice,396034.0,NaN,NaN,NaN,NaT,NaT,2.867826,4.265226,0.04,1.25,1.95,3.75,649.5
revenue,396034.0,NaN,NaN,NaN,NaT,NaT,21.492062,93.863439,0.06,4.68,11.8,19.8,38970.0
customerid,396034.0,NaN,NaN,NaN,NaT,NaT,15302.695435,1709.744925,12347.0,13975.0,15160.0,16805.0,18287.0
country,396034,35,United Kingdom,353983,NaT,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
nullid,198017.0,NaN,NaN,NaN,NaT,NaT,198017.0,114325.456929,1.0,99009.0,198017.0,297025.0,396033.0

In [48]:
round(df.unitprice.std(), 2)

4.27

In [51]:
df.unitprice.mode()

0    1.25
Name: unitprice, dtype: float64

### Selección dentro del dataframe

In [57]:
df[['quantity', 'unitprice', 'revenue']].tail(3)

        quantity  unitprice  revenue
396031        12       0.19     2.28
396032        12       0.19     2.28
396033         1       0.19     0.19

In [65]:
df[df.quantity==32].head()    # segun condicion

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN
10,536542,2010-12-01 14:11:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.95,94.4,16456,United Kingdom,NaN
30,536795,2010-12-02 15:40:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,15640,United Kingdom,NaN
51,537210,2010-12-05 15:15:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,15953,United Kingdom,51.0
59,537393,2010-12-06 13:59:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13089,United Kingdom,59.0

In [67]:
(df.quantity==32).sum()

1003

In [68]:
df[~(df.quantity==32)].head()    # ~ es el NO logico, lo que no es 32

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0

In [69]:
df[df.quantity!=32].head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,5.0

In [72]:
df[(df.quantity==32) & (df.unitprice==0.29)].head()   # multicondicion

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
193560,580662,2011-12-05 13:58:00,22578,WOODEN STAR CHRISTMAS SCANDINAVIAN,32,0.29,9.28,15856,United Kingdom,NaN

In [76]:
df[(df.quantity==32) & ~(df.unitprice==0.29)].shape

(1002, 10)

In [78]:
df[df.country=='EIRE'].shape

(7136, 10)

In [77]:
df[(df.quantity==32) & ~(df.unitprice==0.29) | (df.country=='EIRE')].shape   # | es or

(8118, 10)

In [79]:
df[(df.quantity==32) & (~(df.unitprice==0.29) | (df.country=='EIRE'))].shape   # | es or

(1002, 10)

In [80]:
# seleccion por indices

df.iloc[0]  # primera fila

invoiceno                                  536365
invoicedate                   2010-12-01 08:26:00
stockcode                                  85123A
description    CREAM HANGING HEART T-LIGHT HOLDER
quantity                                        6
unitprice                                    2.55
revenue                                      15.3
customerid                                  17850
country                            United Kingdom
nullid                                        NaN
Name: 0, dtype: object

In [83]:
df.iloc[0:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0

In [86]:
df.iloc[0:2, 1:6:2]  # df.iloc[fila_inicial: fila_final : step_fila, columna_inicial: columna_final: step_colum] por indice

          invoicedate                         description  unitprice
0 2010-12-01 08:26:00  CREAM HANGING HEART T-LIGHT HOLDER       2.55
1 2010-12-01 09:02:00  CREAM HANGING HEART T-LIGHT HOLDER       2.55

In [87]:
df.loc[0:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN

In [89]:
df.loc[0:2, 'invoicedate']

0   2010-12-01 08:26:00
1   2010-12-01 09:02:00
2   2010-12-01 09:32:00
Name: invoicedate, dtype: datetime64[ns]

In [90]:
df.loc[0:2, 'invoicedate':'unitprice']

,invoicedate,stockcode,description,quantity,unitprice
0,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55
1,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55
2,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55

In [91]:
df.loc[:2, ['invoicedate', 'unitprice']]

          invoicedate  unitprice
0 2010-12-01 08:26:00       2.55
1 2010-12-01 09:02:00       2.55
2 2010-12-01 09:32:00       2.55

In [93]:
df.index=[str(i) for i in range(len(df))]

df.index[:5]

Index(['0', '1', '2', '3', '4'], dtype='object')

In [99]:
df.iloc[:2]

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0

In [98]:
df.loc['0':'2']

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN

In [101]:
df.reset_index().head()

,index,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [104]:
df.reset_index(inplace=True, drop=True)  # inplace=True es para sobreescribir el df, drop=True para borrar esa columna

In [106]:
df.index

RangeIndex(start=0, stop=396034, step=1)

In [114]:
df.sample(5)   # muestra aleatoria de 5 filas

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
95978,572216,2011-10-21 12:56:00,22537,MAGIC DRAWING SLATE DINOSAUR,5,0.42,2.10,16015,United Kingdom,NaN
266828,542691,2011-01-31 12:34:00,84978,HANGING HEART JAR T-LIGHT HOLDER,72,1.06,76.32,13408,United Kingdom,NaN
160188,540971,2011-01-12 14:10:00,22624,IVORY KITCHEN SCALES,2,8.50,17.00,12383,Belgium,NaN
322831,549954,2011-04-13 13:25:00,23159,SET OF 5 PANCAKE DAY MAGNETS,12,2.08,24.96,13700,United Kingdom,322831.0
377482,567213,2011-09-19 11:04:00,23333,IVORY WICKER HEART MEDIUM,1,1.25,1.25,14684,United Kingdom,NaN

In [117]:
df.sample(frac=0.1).head()  # muestra aleatoria del 10% de los datos

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
267394,539414,2010-12-17 13:45:00,22175,PINK OWL SOFT TOY,1,2.95,2.95,16931,United Kingdom,NaN
23704,552848,2011-05-11 14:49:00,21733,RED HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14367,United Kingdom,NaN
15986,544483,2011-02-21 10:53:00,22631,CIRCUS PARADE LUNCH BOX,12,1.95,23.40,12524,Germany,NaN
358612,575914,2011-11-11 16:31:00,23321,SMALL WHITE HEART OF WICKER,40,1.45,58.00,17071,United Kingdom,NaN
263673,548171,2011-03-29 13:58:00,22525,CHILDRENS GARDEN GLOVES PINK,10,1.25,12.50,16422,United Kingdom,263673.0

In [119]:
df._get_numeric_data().head()   # solo columnas numericas

   invoiceno  quantity  unitprice  revenue  customerid  nullid
0     536365         6       2.55     15.3       17850     NaN
1     536373         6       2.55     15.3       17850     1.0
2     536375         6       2.55     15.3       17850     NaN
3     536390        64       2.55    163.2       17511     3.0
4     536394        32       2.55     81.6       13408     NaN

In [121]:
df.select_dtypes(include=['float64', 'bool'], exclude='object').head()

   unitprice  revenue  nullid
0       2.55     15.3     NaN
1       2.55     15.3     1.0
2       2.55     15.3     NaN
3       2.55    163.2     3.0
4       2.55     81.6     NaN

In [124]:
stats=df.describe().T

In [126]:
stats['50%']

invoiceno     561894.00
quantity           6.00
unitprice          1.95
revenue           11.80
customerid     15160.00
nullid        198017.00
Name: 50%, dtype: float64

In [133]:
df.sort_values('quantity', ascending=False).reset_index(drop=True).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,573008,2011-10-27 12:26:00,84077,WORLD WAR 2 GLIDERS ASSTD DESIGNS,4800,0.21,1008.00,12901,United Kingdom,204695.0
1,554868,2011-05-27 10:52:00,22197,POPCORN HOLDER,4300,0.72,3096.00,13135,United Kingdom,60689.0
2,544612,2011-02-22 10:43:00,22053,EMPIRE DESIGN ROSETTE,3906,0.82,3202.92,18087,United Kingdom,289629.0
3,560599,2011-07-19 17:04:00,18007,ESSENTIAL BALM 3.5g TIN IN ENVELOPE,3186,0.06,191.16,14609,United Kingdom,NaN
4,550461,2011-04-18 13:20:00,21108,FAIRY CAKE FLANNEL ASSORTED COLOUR,3114,2.10,6539.40,15749,United Kingdom,86827.0

### Cambio del tipo de datos

In [140]:
df.quantity.astype(dtype='int16').head()

0     6
1     6
2     6
3    64
4    32
Name: quantity, dtype: int16

In [141]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int64
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(3)
memory usage: 93.7 MB

In [144]:
df.quantity=df.quantity.astype(dtype='int8')

df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int8
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(2), int8(1), object(3)
memory usage: 91.1 MB

### Manejo de valores nulos

In [145]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 396034 entries, 0 to 396033
Data columns (total 10 columns):
 #   Column       Non-Null Count   Dtype
---  ------       --------------   -----
 0   invoiceno    396034 non-null  int64
 1   invoicedate  396034 non-null  datetime64[ns]
 2   stockcode    396034 non-null  object
 3   description  396034 non-null  object
 4   quantity     396034 non-null  int8
 5   unitprice    396034 non-null  float64
 6   revenue      396034 non-null  float64
 7   customerid   396034 non-null  int64
 8   country      396034 non-null  object
 9   nullid       198017 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(2), int8(1), object(3)
memory usage: 27.6+ MB

In [147]:
df.isna().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,True

In [148]:
df.isnull().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,False,False,False,False,False,False,False,False,False,True
1,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,True
3,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,True

In [149]:
df.notna().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,True,True,True,True,True,True,True,True,True,False
1,True,True,True,True,True,True,True,True,True,True
2,True,True,True,True,True,True,True,True,True,False
3,True,True,True,True,True,True,True,True,True,True
4,True,True,True,True,True,True,True,True,True,False

In [151]:
nan_cols=df.isna().sum()

nan_cols[nan_cols>0]

nullid    198017
dtype: int64

**¿Qué hacemos?**

In [152]:
# podemos rellenar

df.fillna(0).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,0.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,0.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,0.0

In [153]:
df.fillna('hola').head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,hola
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,hola
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,hola

In [154]:
df.fillna(df.nullid.mean()).head()   # con la media

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,198017.0

In [158]:
df.fillna(df.nullid.median()).head()   # con la mediana

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,198017.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,198017.0

In [159]:
# podemos borrar la columna

df.drop('nullid', axis=1).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [162]:
df.drop(columns=['nullid', 'customerid']).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,United Kingdom

In [164]:
df[df.country=='United Kingdom'].revenue.mean()

19.832051341448604

In [165]:
df[df.country=='Spain'].revenue.mean()

23.007890173410406

In [170]:
# podemos borrar registros, filas

df[df.nullid.notna()].head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,5.0
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14729,United Kingdom,9.0

In [174]:
df.dropna(axis=0).head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,1.0
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,17511,United Kingdom,3.0
5,536396,2010-12-01 10:51:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,5.0
7,536406,2010-12-01 11:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,8,2.55,20.40,17850,United Kingdom,7.0
9,536520,2010-12-01 12:43:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,3,2.95,8.85,14729,United Kingdom,9.0

In [176]:
# eliminar duplicados

df.drop_duplicates().head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,1.0
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom,NaN
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom,3.0
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom,NaN

In [180]:
df.drop_duplicates(subset=['country']).reset_index(drop=True)

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.30,17850,United Kingdom,NaN
1,538095,2010-12-09 14:55:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,1,2.95,2.95,17097,Spain,103.0
2,538826,2010-12-14 12:58:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.20,12370,Cyprus,147.0
3,539320,2010-12-16 19:16:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,24,2.95,70.80,14911,EIRE,179.0
4,539353,2010-12-17 11:30:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,12782,Portugal,183.0
5,541570,2011-01-19 12:34:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,0,2.55,652.80,14646,Netherlands,NaN
6,541657,2011-01-20 12:11:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,16321,Australia,307.0
7,542102,2011-01-25 13:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,18,2.95,53.10,12744,Singapore,NaN
8,544931,2011-02-24 18:59:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,36,2.55,91.80,13501,Switzerland,477.0
9,545226,2011-03-01 09:33:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,12428,Finland,NaN
10,546252,2011-03-10 14:42:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,12,2.95,35.40,14930,Channel Islands,NaN
11,551163,2011-04-26 15:52:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,9,2.95,26.55,12573,France,807.0
12,555931,2011-06-08 08:31:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,17828,Malta,NaN
13,562528,2011-08-05 13:52:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.95,17.70,12610,Italy,1325.0
14,569527,2011-10-04 14:53:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,1,2.95,2.95,12512,Israel,1601.0
15,578472,2011-11-24 12:40:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,12,2.95,35.40,12476,Germany,1927.0
16,576019,2011-11-13 14:31:00,84406B,CREAM CUPID HEARTS COAT HANGER,4,4.15,16.60,12865,Austria,2527.0
17,566195,2011-09-09 13:44:00,84029E,RED WOOLLY HOTTIE WHITE HEART.,8,3.95,31.60,12433,Norway,2991.0
18,577126,2011-11-17 19:22:00,84029E,RED WOOLLY HOTTIE WHITE HEART.,8,4.25,34.00,12406,Denmark,NaN
19,552957,2011-05-12 12:36:00,22752,SET 7 BABUSHKA NESTING BOXES,2,8.50,17.00,17404,Sweden,3331.0
20,577046,2011-11-17 13:46:00,22752,SET 7 BABUSHKA NESTING BOXES,2,8.50,17.00,12449,Belgium,3461.0
21,546533,2011-03-14 13:53:00,84879,ASSORTED COLOUR BIRD ORNAMENT,8,1.69,13.52,15388,Canada,NaN
22,554654,2011-05-25 13:34:00,22745,POPPY'S PLAYHOUSE BEDROOM,6,2.10,12.60,12815,Poland,6019.0
23,537218,2010-12-05 15:46:00,22749,FELTCRAFT PRINCESS CHARLOTTE DOLL,16,3.75,60.00,12763,Japan,NaN
24,537626,2010-12-07 14:57:00,84969,BOX OF 6 ASSORTED COLOUR TEASPOONS,6,4.25,25.50,12347,Iceland,NaN
25,580752,2011-12-06 09:56:00,22623,BOX OF VINTAGE JIGSAW BLOCKS,3,5.95,17.85,12478,Greece,7311.0
26,542276,2011-01-27 10:19:00,21754,HOME BUILDING BLOCK WORD,6,5.95,35.70,12764,Lebanon,NaN
27,571035,2011-10-13 12:50:00,22960,JAM MAKING SET WITH JARS,6,4.25,25.50,12446,South Africa,NaN
28,545072,2011-02-28 08:43:00,21791,VINTAGE HEADS AND TAILS CARD GAME,12,1.25,15.00,12781,Czech Republic,NaN
29,570467,2011-10-10 16:06:00,22326,ROUND SNACK BOXES SET OF4 WOODLAND,6,2.95,17.70,12607,USA,14537.0
30,550201,2011-04-15 10:25:00,22629,SPACEBOY LUNCH BOX,12,1.95,23.40,12769,Brazil,14907.0
31,565218,2011-09-01 17:45:00,22629,SPACEBOY LUNCH BOX,12,1.95,23.40,12739,United Arab Emirates,NaN
32,537081,2010-12-05 12:00:00,20679,EDWARDIAN PARASOL RED,12,5.95,71.40,15332,Lithuania,NaN
33,544838,2011-02-24 10:34:00,22915,ASSORTED BOTTLE TOP MAGNETS,12,0.42,5.04,12565,Saudi Arabia,54841.0
34,552449,2011-05-09 13:49:00,72802C,VANILLA SCENT CANDLE JEWELLED BOX,6,4.25,25.50,12355,Bahrain,NaN

In [186]:
df[df.duplicated()].sort_values('invoiceno').head()

,invoiceno,invoicedate,stockcode,description,quantity,unitprice,revenue,customerid,country,nullid
112758,536412,2010-12-01 11:49:00,21448,12 DAISY PEGS IN WOOD BOX,2,1.65,3.30,17920,United Kingdom,NaN
63650,536749,2010-12-02 13:49:00,22174,PHOTO CUBE,2,1.65,3.30,17976,United Kingdom,NaN
102096,536749,2010-12-02 13:49:00,22371,AIRLINE BAG VINTAGE TOKYO 78,1,4.25,4.25,17976,United Kingdom,NaN
230432,536749,2010-12-02 13:49:00,21415,CLAM SHELL SMALL,2,2.10,4.20,17976,United Kingdom,NaN
170090,536796,2010-12-02 15:46:00,21967,PACK OF 12 SKULL TISSUES,1,0.29,0.29,15574,United Kingdom,NaN

### Agrupación

In [190]:
df.groupby('country').mean().head()     # para agrupar SIEMPRE es necesaria una funcion de agragacion

/var/folders/fv/zc4lh9sn7bnf55fy6jhl0k900000gn/T/ipykernel_5512/26225150.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby('country').mean().head()     # para agrupar SIEMPRE es necesaria una funcion de agragacion

,invoiceno,quantity,unitprice,revenue,customerid,nullid
country,,,,,,
Australia,556195.569009,18.367485,2.762489,116.995182,12454.574090,204905.351494
Austria,562611.684896,9.947917,2.984115,22.767396,12521.828125,192307.557895
Bahrain,552790.411765,15.294118,4.644118,32.258824,12354.529412,216702.333333
Belgium,560603.708527,11.469767,3.042817,19.083897,12431.118346,199700.586777
Brazil,550201.000000,11.125000,4.456250,35.737500,12769.000000,193760.285714

In [191]:
df.groupby('country').agg({'quantity': 'sum', 'revenue': 'mean'}).head()

           quantity     revenue
country
Australia     21692  116.995182
Austria        3820   22.767396
Bahrain         260   32.258824
Belgium       22194   19.083897
Brazil          356   35.737500

In [192]:
df.groupby('country').agg({'quantity': 'sum', 'revenue': 'mean'}).reset_index().head()

     country  quantity     revenue
0  Australia     21692  116.995182
1    Austria      3820   22.767396
2    Bahrain       260   32.258824
3    Belgium     22194   19.083897
4     Brazil       356   35.737500

In [193]:
def suma(x):
    """
    Esta funcion recibe una serie de pandas, devuelve un numero
    """
    return sum(x+2)

In [194]:
df.groupby('country').agg({'quantity': suma, 'revenue': 'mean'}).reset_index().head()

     country  quantity     revenue
0  Australia     24054  116.995182
1    Austria      4588   22.767396
2    Bahrain       294   32.258824
3    Belgium     26064   19.083897
4     Brazil       420   35.737500

In [195]:
df.groupby('country').agg({'unitprice': ['mean', 'std', 'median']}).reset_index().head()

     country unitprice
                  mean       std median
0  Australia  2.762489  2.424046   1.79
1    Austria  2.984115  3.161760   1.95
2    Bahrain  4.644118  3.673634   2.95
3    Belgium  3.042817  3.402533   1.95
4     Brazil  4.456250  2.831727   3.32

In [196]:
df.groupby('country').agg({'unitprice': ['mean', 'std', 'median']}).reset_index().columns

MultiIndex([(  'country',       ''),
            ('unitprice',   'mean'),
            ('unitprice',    'std'),
            ('unitprice', 'median')],
           )

In [197]:
df.groupby(['country', 'unitprice']).agg('max').head()

/var/folders/fv/zc4lh9sn7bnf55fy6jhl0k900000gn/T/ipykernel_5512/2401352451.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.max is deprecated. In a future version, a TypeError will be raised. Before calling .max, select only columns which should be valid for the function.
  df.groupby(['country', 'unitprice']).agg('max').head()

                     invoiceno         invoicedate  \
country   unitprice
Australia 0.19          578459 2011-11-24 12:30:00
          0.25          545475 2011-03-03 10:59:00
          0.29          559919 2011-07-13 15:30:00
          0.34          563614 2011-08-18 08:51:00
          0.36          569650 2011-10-05 12:44:00

                                          description  quantity  revenue  \
country   unitprice
Australia 0.19          STAR DECORATION PAINTED ZINC         96    45.60
          0.25           PACK OF 12 WOODLAND TISSUES        -80   108.00
          0.29       FRENCH STYLE STORAGE JAR BONBONS        48    69.60
          0.34                       WRAP WEDDING DAY       -56   136.00
          0.36                VINTAGE KID DOLLY CARD        120   103.68

                     customerid    nullid
country   unitprice
Australia 0.19            12415       NaN
          0.25            12415  170927.0
          0.29            12415  320717.0
          0.34            12415  373541.0
          0.36            12415  388229.0

In [198]:
df.groupby(['country', 'unitprice']).agg('mean').head()

/var/folders/fv/zc4lh9sn7bnf55fy6jhl0k900000gn/T/ipykernel_5512/3141882802.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby(['country', 'unitprice']).agg('mean').head()

                         invoiceno   quantity     revenue    customerid  \
country   unitprice
Australia 0.19       566002.500000  40.000000   31.920000  12401.500000
          0.25       545475.000000 -80.000000  108.000000  12415.000000
          0.29       558418.000000  16.000000   41.760000  12415.000000
          0.34       555813.050000 -61.600000   74.800000  12415.000000
          0.36       553949.882353 -11.411765   60.945882  12414.147059

                            nullid
country   unitprice
Australia 0.19                 NaN
          0.25       170419.666667
          0.29       274236.000000
          0.34       275419.000000
          0.36       170596.375000

### Pivot table 

https://archive.ics.uci.edu/ml/datasets/Student+Performance

In [203]:
student=pd.read_csv('../data/student-por.csv', sep=';')

student.head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
0,GP,F,18,U,GT3,A,4,4,at_home,teacher,...,4,3,4,1,1,3,4,0,11,11
1,GP,F,17,U,GT3,T,1,1,at_home,other,...,5,3,3,1,1,3,2,9,11,11
2,GP,F,15,U,LE3,T,1,1,at_home,other,...,4,3,2,2,3,3,6,12,13,12
3,GP,F,15,U,GT3,T,4,2,health,services,...,3,2,2,1,1,5,0,14,14,14
4,GP,F,16,U,GT3,T,3,3,other,other,...,4,3,2,1,2,5,0,11,13,13

In [204]:
student.school.unique()

array(['GP', 'MS'], dtype=object)

In [206]:
student.pivot_table(index=['school'], columns=['sex'])

/var/folders/fv/zc4lh9sn7bnf55fy6jhl0k900000gn/T/ipykernel_5512/1258595654.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  student.pivot_table(index=['school'], columns=['sex'])

            Dalc                Fedu                   G1             \
sex            F         M         F         M          F          M
school
GP      1.291139  1.698925  2.396624  2.575269  12.286920  11.602151
MS      1.273973  2.087500  1.958904  2.050000  10.582192   9.787500

               G2                    G3             ...  freetime            \
sex             F          M          F          M  ...         F         M
school                                              ...
GP      12.502110  11.688172  13.004219  12.032258  ...  2.953586  3.408602
MS      10.719178  10.087500  11.034247   9.950000  ...  3.212329  3.262500

           goout              health           studytime           traveltime  \
sex            F         M         F         M         F         M          F
school
GP      3.109705  3.193548  3.464135  3.768817  2.189873  1.790323   1.405063
MS      3.157534  3.437500  3.212329  3.800000  1.883562  1.575000   1.767123


sex            M
school
GP      1.462366
MS      1.937500

[2 rows x 32 columns]

In [208]:
student.pivot_table(index=['school'], columns=['sex'], aggfunc='max')

       Dalc    Fedu        Fjob           G1      G2      ...      reason  \
sex       F  M    F  M        F        M   F   M   F   M  ...           F
school                                                    ...
GP        5  5    4  4  teacher  teacher  18  18  19  18  ...  reputation
MS        4  5    4  4  teacher  teacher  19  17  18  18  ...  reputation

                   romantic      schoolsup      studytime    traveltime
sex              M        F    M         F    M         F  M          F  M
school
GP      reputation      yes  yes       yes  yes         4  4          4  4
MS      reputation      yes  yes       yes  yes         4  4          4  4

[2 rows x 62 columns]

In [212]:
student.pivot_table(index=['school'], columns=['sex'], values=['G3'], aggfunc=['count', 'min', 'max', 'mean'])

       count      min    max           mean
          G3       G3     G3             G3
sex        F    M   F  M   F   M          F          M
school
GP       237  186   7  0  19  18  13.004219  12.032258
MS       146   80   0  0  18  19  11.034247   9.950000

pandas.pivot_table(data, values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)

### Cross table

In [211]:
pd.crosstab(index=student.sex, columns='count')

col_0  count
sex
F        383
M        266

In [237]:
cross=pd.crosstab(index=student.sex, columns=student.activities)

cross * 100 / cross.sum().sum()

activities         no        yes
sex
F           33.436055  25.577812
M           18.027735  22.958398

In [246]:
cross * 100 / cross.sum().sum()

cross.T.sum()

sex
F    383
M    266
dtype: int64

In [250]:
pert=cross * 100 / cross.sum().sum()

pert.T.sum()

sex
F    59.013867
M    40.986133
dtype: float64

In [230]:
cross

activities   no  yes
sex
F           217  166
M           117  149

In [216]:
pd.crosstab(index=student.sex, columns=student.famsize, values=student.absences, aggfunc='count')

famsize  GT3  LE3
sex
F        284   99
M        173   93

In [217]:
pd.crosstab(index=student.sex, columns=student.famsize, values=student.absences, aggfunc='mean')

famsize       GT3       LE3
sex
F        3.616197  3.464646
M        3.693642  3.935484

In [224]:
student[(student.famsize=='GT3') & (student.sex=='F') & (student.school=='GP')].sort_values('absences', ascending=False).head()

,school,sex,age,address,famsize,Pstatus,Medu,Fedu,Mjob,Fjob,...,famrel,freetime,goout,Dalc,Walc,health,absences,G1,G2,G3
212,GP,F,17,U,GT3,T,4,4,services,teacher,...,4,2,4,2,3,2,30,14,15,16
150,GP,F,15,U,GT3,A,3,3,services,services,...,1,3,2,2,3,1,24,9,8,9
217,GP,F,17,R,GT3,T,2,2,other,other,...,5,3,2,1,2,3,21,13,13,13
397,GP,F,17,U,GT3,A,2,2,at_home,at_home,...,3,3,1,1,2,4,18,10,12,14
311,GP,F,19,U,GT3,T,3,3,other,services,...,4,3,5,3,3,5,16,11,12,12

In [220]:
student.columns

Index(['school', 'sex', 'age', 'address', 'famsize', 'Pstatus', 'Medu', 'Fedu',
       'Mjob', 'Fjob', 'reason', 'guardian', 'traveltime', 'studytime',
       'failures', 'schoolsup', 'famsup', 'paid', 'activities', 'nursery',
       'higher', 'internet', 'romantic', 'famrel', 'freetime', 'goout', 'Dalc',
       'Walc', 'health', 'absences', 'G1', 'G2', 'G3'],
      dtype='object')

### Aplicación de funciones

### Json Normalize, Explode

### Unión de dataframes

### Eval y query

### lookup

### get

### index y reindex

### Multi index

### Exportar datos

### Métodos habituales de pandas

```python
df.head()                     # printea la cabeza, por defecto 5 filas
df.tail()                     # pritea la cola, por defecto 5 filas
df.describe()                 # descripcion estadistica
df.info()                     # informacion del df
df.info(memory_usage='deep')
df.columns                    # muestra columna
df.index                      # muestra indice
df.dtypes                     # muestra tipos de datos de las columnas
df.plot()                     # hace un grafico
df.hist()                     # hace un histograma
df.col.value_counts()         # cuenta los valores unicos de una columna
df.col.unique()               # muestra valores unicos de una columna
df.copy()                     # copia el df
df.drop()                     # elimina columnas o filas (axis=0,1)
df.dropna()                   # elimina nulos
df.fillna()                   # rellena nulos
df.shape                      # dimensiones del df
df._get_numeric_data()        # selecciona columnas numericas
df.rename()                   # renombre columnas
df.str.replace()              # reemplaza columnas de strings
df.astype(dtype='float32')    # cambia el tipo de dato
df.iloc[]                     # localiza por indice
df.loc[]                      # localiza por elemento
df.transpose()                # transpone el df
df.T
df.sample(n, frac)            # muestra del df
df.col.sum()                  # suma de una columna
df.col.max()                  # maximo de una columna
df.col.min()                  # minimo de una columna
df[col]                       # selecciona columna
df.col
df.isnull()                   # valores nulos
df.isna()
df.notna()                    # valores no nulos
df.drop_duplicates()          # eliminar duplicados
df.reset_index(inplace=True)  # resetea el indice y sobreescribe
```